function pow(x, y) {
    let result = 1; 
    
    for (let i = 0; i < y; i++) { 
        result = result * x; 
    }

    return result; 
}

let result = pow(2, 3); 
console.log(result); 
/* пояснення: оскільки за умовою задачі ми не можемо використовувати **,
то нам необхідно створити цикл, який будет множити х на себе стільки разів,
скільки вказано в у
для цього ми спочатку створюємо функцію,
у тілі функції ми об'являємо змінну result з початковим значенням 1, бо
будь-яке число, помножене на 1 не зміниться.
змінна result буде множитись на х при кожній ітерації циклу.
тепер створюємо цикл, де i = 0, який буде повторюватись стільки разів
поки i буде менше у. У кожній ітерації і збільшується на 1 і++
після кожної ітерації нам буде повертати зміну result з оновленим значенням.
отже, якщо х = 2, а у = 3, то:
1 ітерація і = 0: result * x = 1 * 2 = 2, тобто let result тепер = 2
2 ітерація і = 1: result * x = 2 * 2 = 4, тобто let result тепер = 4
3 ітерація і = 2: result * x = 4 * 2 = 8, тобто let result тепер = 8
на 3 ітерації цикл зупиняється бо наступного разу і буде = 3,
а треба щоб і<y , y = 3